
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       20 |           1 |            2 |
## Affected resources by action

|  Action  | Resources                                                                                                     |
|:--------:|:--------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                            |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating`                                      |
|    🟢    | `module.actions-runner-noble.aws_iam_policy.required`                                                         |
|    🟢    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                              |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_instance_profile.profile`                        |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile`                                  |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_role.profile`                                    |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_role_policy_attachment.profile`                  |
|    🟢    | `module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale`                             |
|    🟢    | `module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out`                    |
|    🟢    | `module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda`                             |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging`                               |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions`                           |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_logs`                  |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_permissions`           |
|    🟢    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`                                    |
|    🟢    | `module.actions-runner-noble.module.registration.aws_lambda_function_event_invoke_config.runner_registration` |
|    🟢    | `module.actions-runner-noble.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`   |
|    🟡    | `module.actions-runner.module.instance-profile.aws_iam_instance_profile.profile`                              |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner-noble.data.aws_iam_policy_document.required_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:SetInstanceHealth",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*",
            ]
        }
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be created
  + resource "aws_autoscaling_group" "actions-runner" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 900
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 432000
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-004bd6d011ea52557",
          + "subnet-0dbff142ba4620c5f",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + initial_lifecycle_hook {
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "launching"
            # (3 unchanged attributes hidden)
        }

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }
              + override (known after apply)
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "303467602807"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-303467602807"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/actions-runner/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "development"
        }
      + tag {
          + key                 = "lambda_name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }

      + traffic_source (known after apply)
    }

  # module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "terminating"
    }

  # module.actions-runner-noble.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be created
  + resource "aws_launch_template" "actions-runner" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-04f7a54071e74f488"
      + instance_type          = "t3a.small"
      + key_name               = "actions-runner-generated-20250324031808267600000004"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner-"
      + tags                   = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHYWI1RVVCRUFDeGVBOHpvQkVZWXF6cDljQmpYb3VEWlAyeXVmN0RTUFNFenhjYjZuVitLaUlwNkwzcgogICAgICAgIG5PVE9uaTAxZHBON1JFdXAwbHArekdDRU5XRDBpTlJySGdPMG5rTmF1RFNCMzRrOGdpdVhMdzVzUytzeXFyOHUKICAgICAgICBJdDBsbW1xeW1kTXFtbXAxRER2REhtYlJ2YS9MY0daZlhwV1Nvdk53d0wrR3hHemFxbnluSmIvMmxLOVEyRnU0CiAgICAgICAgNERMRkMvVnlkM2ZTa0dmUm1pcHJoSmM5OGV4ODRGK3UxRGNJWE91QnNFRWZ5bGtKNFROcmFyMDNHTTFoWFJWOQogICAgICAgIDhXUTdCQ2loTkhZOWp2MzBpLzlPRGhSZkh0ZGdKbWNCVEhBdWRKK1cxWDIyNXFIblViYjE2MnJGSVJDb0JaL2UKICAgICAgICAwOHl5NUFnd2d2OHY2Z3dMZm11cGFIanFYSC9DUmhHV0p0eVhidjAyTHRNVVlSaEFqZ2VmV3NZTy9heHlIVStiCiAgICAgICAgVmhHSkdqSll6SU5VMWg2UFYxcnV4cWd3RW13cWZ3dmlxaEJmbHZ6WUdlRGNQT2hUekRNR0Yzb2JNckg2a1dSNAogICAgICAgIEI1aHVvZ0M5dVR6MzkxcWl2Tml1NFVDL0I3elpwWlRSeDNpbkljUjdrYytYcDdhcG1aWmVWZXg3K3hiNE9qNW0KICAgICAgICAxMkpKQzRrcVFqOFEwSFpYK0tWbkJjaUN6eHJOeit2bFExcUcvU2NYejFlM3dQM05iMUVqR0YrVFVhUGtPM3ZMCiAgICAgICAgSVM1Z0JXQ0p4ODgzY2w2WWtZWE9BVTZ1dzlIWTNZcFNMc3RBcEREZ3hJNmp1MHA4UkUrSE9MRkp5RkxPd0pmTQogICAgICAgIGNucmZMU05JUXVYZHBFajNhZlVOc2hiNDVPUlhaTGlXVURrMDdaZGlyOWkrL0pFNFNPRnBSdWxBVHdBUkFRQUIKICAgICAgICB0RjFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUNoclpYa2dabTl5SUhOcFoyNXBibWNnVldKMWJuUjFJRzV2CiAgICAgICAgWW14bElISmxjRzl6YVhSdmNua3BJRHh3WVdOcllXZGxjaTF1YjJKc1pVQnBibVp5WVdodmRYTmxMbU52YlQ2SgogICAgICAgIEFsY0VFd0VJQUVFV0lRU21KN2QyQUJrTHBSdVFORlBUZWhnYmFKcldHUVVDWnB2a1JRSWJBd1VKQThKbkFBVUwKICAgICAgICBDUWdIQWdJaUFnWVZDZ2tJQ3dJRUZnSURBUUllQndJWGdBQUtDUkRUZWhnYmFKcldHVGpzRC85VE5PeGVLZFQ2CiAgICAgICAgNXQvQjBRd2tsK3hyL1NWWm1hVTUvTmJFd1hXdjQwbzMrOXN4UkdBU25RMDl6RTZicEdkektkcUVWUEZlb3VGSwogICAgICAgIFllRHRIVE9LMjArc2l1YkhwMnY0VDBCRHhNMk5HR3Q5cndERmx2L0pDbmY3aXJiVHdyU3FjbzlYck02U3R0NGQKICAgICAgICA4dmlZZXYyclNYSGZ5REdudkduWjM1TFVtSHlHRmx5ekdQVTlNZXI3VnNrWE5EOGUyQkZ4ajduR1RMYlZkNzZMCiAgICAgICAgS0JQOWRFWVJiMTRGTFpxS3Z4cXFiZkp0bFhJNmdnZDdNdVVsbjBpWTBOcWtZVUN0TnZQK0dpbk5tY3Vla21CcwogICAgICAgIFpzbkRPS0JFRFdhMHBEOWJ6bktGNmZWQ2h3aUc2aWFjSDVuWnRlVFE5Uk5tTVpoUStFKzBQTWtpSnlhNnU5UDUKICAgICAgICAreFAwaU05ODRvY2d6S0NMWTFmc0pMUTdGZG54MGdRVkt0S1o5YnBBeS9BWC9uMlZ0cTFLUmNQUHVrbFFUYk92CiAgICAgICAgRHhBajczbWxKL2hSZUVXWDlDL004bE1MZ01EQU1EUUdObC9XVEN1UlB5d1N6MXZ3RHVYMVNLaTBOSno5ZTc2RAogICAgICAgIHFJR1IzSkhVSTBjUHJDODluWW1FdUg0UEtqcytZRGRoa1ZNeGZIVlc2azFzTWNiclJFdm9SdzJjcWZiajk2Sk8KICAgICAgICBKU0VBWEVrdGRIbmJDa1FJd0pUQTM2M20rOVhVSzQ5a29jNWlnc09ORzQrN0hvb3QrZWxQMDZXZ2VsS1BzV3ZqCiAgICAgICAgaUNVWG1vL3ppaGhQYTRVNytYbEJYdURjRFROUmtUc1VzNDJ2eXRnSXBpWkFHTDNPekk1UXpiWjRTcWV3TDVzUAogICAgICAgIHFCdGdOTWp5SVhjNmhCbE9WUGJaYWRvVlczdk5MK2tlK2JrQ0RRUm1tK1JGQVJBQXV0cVFLbzlub08yMHIyci8KICAgICAgICBTWmZHQjluMjFPSitoaHhXZ2laaFNGVTRFNnhmSmowVHIxTWJiZ0ppeXhFSUVSZHBjRzNMRWtTQnhMaXF3RitqCiAgICAgICAgYzFlSHRERHpRbDk2OEFLTGN4a2pJcUZYVjF6V2hTRTFTVFV6WllyTHh0SkwwWDYwdnlOZXJHY3JJYng2dFR4SwogICAgICAgIDIvVEhBQmVab1hqTENhNGVZY1A1cVhYU2s4aVJuNGkxRUJTM2hITjR1Q0RIcHRFNVBsOTNqV0ptdXdvRWtZVHgKICAgICAgICBoeTVSN3haR0FLUHU0eXNmRG1nSVU4eVhlWThDYndDY2Exa2NvVnlNWjRERUdJd2gxSklJNmwzWEEzVldyY29FCiAgICAgICAgNUE4MTRBa2Z2aW80VTlBMjZFNCthR2cvUWdtdm9BNU9wdFo2YW8zV24vT0lON3NueEdnYXdDU3RPZVdyWFI5eQogICAgICAgIGZKYThIWVhKRGEvVG9FdHkwT1R4Z2lFeFFXWVBUYU82QWQvYzZjYWJJUnFnM1h2QzJsbGg4Rkc1V052UCs0bS8KICAgICAgICBGeTN5MnBEanljMndFTExCWlZvTDcwOUZkdFBGNGFqUTVrQ3k3ZlVKMi9zcUpEa1RYdGEzcWI0UnBURm9kSmRCCiAgICAgICAgMHd0Z0tmbXdqRTUvb2pBWUFFZ0lCVm54RXcvczR6MURjOWtxcFA0UDRVRUJxdjhaWHBCcHV6cGN0WDNESVlBeQogICAgICAgIG9PVTdYZTFDSWFIZGhQN2xicnlkb0pUeHJvd1I3WXowdHpvdGhqV2ZGQXFMMW9lOVhEcnl3YjMwKzlDVzRmQy8KICAgICAgICBvcTE4Z3phcUVBT0w4V3lGNHYzQkdzSHVGWjM0YVB0ZnJHczVNZUNvS3FnOHd6bi9mdklkMHk2dldxYXRQZmNzCiAgICAgICAgWXNuM0RDOTdiNThLMjhVUXlwcDlIWTlvYUtrQUVRRUFBWWtDUEFRWUFRZ0FKaFloQktZbnQzWUFHUXVsRzVBMAogICAgICAgIFU5TjZHQnRvbXRZWkJRSm1tK1JGQWhzTUJRa0R3bWNBQUFvSkVOTjZHQnRvbXRZWmpUOFAvMXJPYzk3S2syZkwKICAgICAgICBkZ1VZUDY2TVErNTFIMWlGaDRlalkzbzBqeEsza0NURThJaHJQZVZOSW9pTFpvaFFnUHJwRHBROWFRVDJnalNhCiAgICAgICAgWVBBVTl6QmwrV2lzaFFuckZmenZWVGNPNVBWMHhoVEtXdEJ0WmR6RnYwV2NJUnRtOWdPWVc1R2hCbTBPZjVCRQogICAgICAgIDZRb3hHODRuQW1mNWVVZGd4eFFxUG5XVkZUbnh4dyszM0Nudk9CMFpZTDJlb2o2U0V5bWEydFlyV0xMdGtUTnEKICAgICAgICA1TmdTUDB3R1c0U0ZuMEFhL0VpM01GUktGVXFpRnphZXkrdnJXa2hqMFZsNXNweGYxSzZ5ZGppbG1lNXlWc2JuCiAgICAgICAgZ0Z5bGROOTdUOFdyYzRtSGhNUTMvVjE5RHk3SkcrdEVhQjZXREErRnp4K3EyajF4OExwVG5HNWhZSjhYTzlNbwogICAgICAgIDdKUnFQMHN0a1B3anp1bWNPV1pkREZtNG9aODBPekZPOEpkaVBIVi9qS1llVlVrNDUySENLVGU4WElCT2RIbWMKICAgICAgICBwdVlBanRXaVErZzlpMlU4UzJRaGxvb2NtWXRJeDR5UnhnWTlxemMxN0tGREdsL3ZhanlpM1hkeUN1ZURLc3A3CiAgICAgICAgUXZqc2dkbU5tRnVkMjh3dXY4aEltUlRQMlBsMnJnMTdEM0tjaW1RUm4rR0ZCamlTbDVNZHd5dHk5Y2pYWE1lagogICAgICAgIDVRNVVEY1pFOVViVGp4OGJ0TkxlbnhlTXV3WEV4NjBDKzlRU3NZUEFiWHhWVVFRUXRSakpoekp2MHhqcVZ4dDAKICAgICAgICA4NWZKVjE3VXp6Y21ZdnlOS1hPd2VOdkNweFd2L0RZSk5GOTQrb29ZL3JvT0o0VDJzMjQwS0VOck04aDZOVGV4CiAgICAgICAgaGQvMmp1eERQY1JnNlNzUms0dEpXRkZwa0FTclB4OFAKICAgICAgICA9WmhpRQogICAgICAgIC0tLS0tRU5EIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KICAgICAgInNvdXJjZSI6ICJkZWIgW3NpZ25lZC1ieT0kS0VZX0ZJTEVdIGh0dHBzOi8vcmVsZWFzZS1ub2JsZS5pbmZyYWhvdXNlLmNvbS8gJFJFTEVBU0UKICAgICAgICBtYWluIgoicGFja2FnZV91cGRhdGUiOiB0cnVlCiJwYWNrYWdlcyI6Ci0gIm1ha2UiCi0gImdjYyIKLSAicHVwcGV0LWNvZGUiCi0gImluZnJhaG91c2UtdG9vbGtpdCIKLSAicnVieS1ydWJ5Z2VtcyIKLSAicnVieS1kZXYiCi0gImRlYmhlbHBlciIKLSAiZGV2c2NyaXB0cyIKLSAiaW5mcmFob3VzZS1wdXBwZXQtZGF0YSIKLSAiZ29sYW5nIgotICJtYWtlIgotICJweXRob24taXMtcHl0aG9uMyIKInB1cHBldCI6CiAgImNvbGxlY3Rpb24iOiAicHVwcGV0OCIKICAiaW5zdGFsbCI6IHRydWUKICAiaW5zdGFsbF90eXBlIjogImFpbyIKICAicGFja2FnZV9uYW1lIjogInB1cHBldC1hZ2VudCIKICAic3RhcnRfc2VydmljZSI6IGZhbHNlCiAgInZlcnNpb24iOiAiOC4xMC4wIgoicnVuY21kIjoKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBqc29uIgotICJQQVRIPS9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluOiRQQVRIIGdlbSBpbnN0YWxsIGF3cy1zZGstY29yZSIKLSAiUEFUSD0vb3B0L3B1cHBldGxhYnMvcHVwcGV0L2JpbjokUEFUSCBnZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgZGV2ZWxvcG1lbnQgLS1lbnZpcm9ubWVudHBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMKICAtLXJvb3QtZGlyZWN0b3J5IC9vcHQvcHVwcGV0LWNvZGUgLS1oaWVyYS1jb25maWcgL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzCiAgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHAiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJkZXZlbG9wbWVudCIKICAgICJwdXBwZXRfcm9sZSI6ICJnaGFfcnVubmVyIgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJjYW5jZWxfaW5zdGFuY2VfcmVmcmVzaF9vbl9lcnJvclwiOmZhbHNlLFwiZGVidWdcIjpmYWxzZSxcImVudmlyb25tZW50cGF0aFwiOlwie3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHNcIixcImhpZXJhLWNvbmZpZ1wiOlwiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sXCIsXCJtYW5pZmVzdFwiOlwiL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHBcIixcIm1vZHVsZS1wYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cy97ZW52aXJvbm1lbnR9L21vZHVsZXM6e3Jvb3RfZGlyZWN0b3J5fS9tb2R1bGVzXCIsXCJyb290LWRpcmVjdG9yeVwiOlwiL29wdC9wdXBwZXQtY29kZVwifX0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2loLXB1cHBldC5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImxhYmVsc1wiOltcIm9yYWN1bGFyXCJdLFwicmVnaXN0cmF0aW9uX3Rva2VuX3NlY3JldF9wcmVmaXhcIjpcIkdILXJlZy10b2tlbi1XdmZzWldcIn0iCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL2N1c3RvbS5qc29uIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="
      + vpc_security_group_ids = [
          + "sg-09f486fd7ca16fe5a",
        ]

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 64
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
    }

  # module.actions-runner.module.instance-profile.aws_iam_instance_profile.profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "profile" {
        id          = "actions-runner-sbn5RaTtAltb"
        name        = "actions-runner-sbn5RaTtAltb"
      ~ role        = "actions-runner" -> "actions-runner-oracular"
        tags        = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner.module.instance-profile.aws_iam_role.profile must be replaced
-/+ resource "aws_iam_role" "profile" {
      ~ arn                   = "arn:aws:iam::303467602807:role/actions-runner" -> (known after apply)
      ~ create_date           = "2024-12-21T20:34:41Z" -> (known after apply)
      ~ id                    = "actions-runner" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::303467602807:policy/actions-runner-sbn5RaTtAltb20241221203559214000000016",
        ] -> (known after apply)
      ~ name                  = "actions-runner" -> "actions-runner-oracular" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
      ~ unique_id             = "AROAUNKAUEN323FOK37DP" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.profile must be replaced
-/+ resource "aws_iam_role_policy_attachment" "profile" {
      ~ id         = "actions-runner-20241221203559531100000017" -> (known after apply)
      ~ role       = "actions-runner" -> "actions-runner-oracular" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "actions-runner-LVO4bVFWUIxY"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "actions-runner-noble"
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id   = (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "actions-runner-LVO4bVFWUIxY"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "actions-runner-noble"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "actions-runner-noble"
    }

  # module.actions-runner-noble.module.registration.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:RecordLifecycleActionHeartbeat",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:DescribeTags",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:303467602807:instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:PutSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*",
            ]
        }
    }

  # module.actions-runner-noble.module.registration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "asg-scale"
      + tags           = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all       = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out will be created
  + resource "aws_cloudwatch_event_target" "scale-in-out" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "infrahouse-registration20250324031808261700000001"
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "infrahouse-registration20250324031808261700000001"
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::303467602807:role/infrahouse-registration20250324031808261700000001"
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-asg-lambda-20250324031808266500000003"
      + s3_key                         = "fc112e7a-4288-ad2d-7e86-2ca51daa3c5f.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GH_APP_ID"                        = "1016363"
              + "GITHUB_ORG_NAME"                  = "infrahouse"
              + "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE"               = "pem"
              + "LAMBDA_TIMEOUT"                   = "900"
              + "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-WvfsZW"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function_event_invoke_config.runner_registration will be created
  + resource "aws_lambda_function_event_invoke_config" "runner_registration" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 20 to add, 1 to change, 2 to destroy.

Warning: Invalid Attribute Combination

  with module.management.aws_s3_bucket_lifecycle_configuration.vpc_flow_logs,
  on .terraform/modules/management/vpc_flow_logs.tf line 51, in resource "aws_s3_bucket_lifecycle_configuration" "vpc_flow_logs":
  51:     filter {}

No attribute specified when one (and only one) of
[rule[0].filter[0].prefix.<.object_size_greater_than,rule[0].filter[0].prefix.<.object_size_less_than,rule[0].filter[0].prefix.<.and,rule[0].filter[0].prefix.<.tag]
is required

This will be an error in a future version of the provider

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIwLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAyfX0=
```
</details>